Revit.Elements.Grid
A Revit Grid Element

Revit.Elements.Grid.#ctor(Autodesk.Revit.DB.Grid)
Private constructor for wrapping an existing Element
grid:

Revit.Elements.Grid.#ctor(Autodesk.Revit.DB.Line)
Private constructor that creates a new Element every time
line:

Revit.Elements.Grid.#ctor(Autodesk.Revit.DB.Arc)
Private constructor that creates a new Element every time
arc:

Revit.Elements.Grid.InitGrid(Autodesk.Revit.DB.Grid)
Initialize a Grid element
grid:

Revit.Elements.Grid.InitGrid(Autodesk.Revit.DB.Line)
Initialize a Grid element
line:

Revit.Elements.Grid.InitGrid(Autodesk.Revit.DB.Arc)
Initialize a Grid element
arc:

Revit.Elements.Grid.InternalSetGrid(Autodesk.Revit.DB.Grid)
Set the internal Element, ElementId, and UniqueId
grid:

Revit.Elements.Grid.ByLine(Autodesk.DesignScript.Geometry.Line)
Create a Revit Grid Element in a Project along a Line.
line:
Returns:

Revit.Elements.Grid.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create a Revit Grid Element in a project between two end points
start:
end:
Returns:

Revit.Elements.Grid.ByArc(Autodesk.DesignScript.Geometry.Arc)
Create a Revit Grid Element in a project along an Arc
arc:
Returns:

Revit.Elements.Grid.FromExisting(Autodesk.Revit.DB.Grid,System.Boolean)
Wrap an existing Element in the associated DS type
grid:
isRevitOwned:
Returns:

Revit.Elements.Grid.InternalGrid
Internal reference to Element

Revit.Elements.Grid.InternalElement
Reference to the Element

Revit.Elements.Grid.Curve
Get the underlying Curve geometry from this Element

Revit.Elements.Grid.ElementCurveReference
Get a Reference to the underlying Curve Geometry of this Element